# SQL and Python 2

### Background and Objetives
The goal of this challenge is to query fetch information from multiple table using JOIN.

<span style= 'color:grey'> Implement detailed_movies to get all the movie titles with the corresponding genre and director name.
This function should return a list of tuples like (title, genre, name). </span>

In [3]:
import pandas as pd
import sqlite3
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [4]:
conn = sqlite3.connect('data/movies.sqlite')
df = pd.read_sql_query("SELECT movies.title, movies.genres, directors.name FROM movies JOIN directors ON movies.director_id = directors.id ", conn)

In [5]:
df.head(5)

,title,genres,name
0,A Trip to the Moon,"Action,Adventure,Comedy",Georges Méliès
1,The Great Train Robbery,"Action,Crime,Short",Edwin S. Porter
2,The Birth of a Nation,"Drama,History,War",D.W. Griffith
3,Intolerance: Love's Struggle Throughout the Ages,"Drama,History",D.W. Griffith
4,The Cabinet of Dr. Caligari,"Fantasy,Horror,Mystery",Robert Wiene

<span style='color:grey'>Implement never_watched_movies to get the list of all movies which were released after their director passed away.
This function should return a list of movie titles.</span>

In [6]:
df_relesed_movies = pd.read_sql_query("SELECT movies.title FROM movies JOIN directors ON movies.director_id = directors.id WHERE (movies.start_year - directors.death_year) > 0 ORDER BY movies.title ", conn)

In [7]:
df_relesed_movies

                                    title
0                                    Cars
1                           Fantasia 2000
2                           Game of Death
3  The Many Adventures of Winnie the Pooh
4                            The Rescuers
5                                Waitress

In [13]:
df_topfive_directors = pd.read_sql_query('''
SELECT directors.name, COUNT(*) AS movie_count
FROM movies
JOIN directors ON movies.director_id = directors.id
WHERE movies.genre = ? 
GROUP BY directors.name
ORDER BY movie_count DESC, directors.name
LIMIT 5
''', conn)

DatabaseError: Execution failed on sql '
SELECT directors.name, COUNT(*) AS movie_count
FROM movies
JOIN directors ON movies.director_id = directors.id
WHERE movies.genre = Action
GROUP BY directors.name
ORDER BY movie_count DESC, directors.name
LIMIT 5
': no such column: movies.genre

In [8]:
df_topfive_directors

              name
0   Georges Méliès
1  Edwin S. Porter
2    D.W. Griffith
3    D.W. Griffith
4     Robert Wiene

In [9]:
df_prueba = pd.read_sql_query('''
SELECT movies.genres
FROM movies
''', conn)

In [10]:
df_prueba

                          genres
0        Action,Adventure,Comedy
1             Action,Crime,Short
2              Drama,History,War
3                  Drama,History
4         Fantasy,Horror,Mystery
...                          ...
9870                       Drama
9871    Animation,Comedy,Fantasy
9872    Animation,Comedy,Fantasy
9873    Animation,Comedy,Fantasy
9874  Action,Adventure,Animation

[9875 rows x 1 columns]